W7D2/practice-for-ch-rails-music-app-long-practice/MusicApp/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_band
      @band = Band.find(params[:id])