W6D3/RoutesProject/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("created_at", "updated_at", "viewer_id", "artwork_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2023-08-03 17:44:23.955743"], ["updated_at", "2023-08-03 17:44:23.955743"], ["viewer_id", 1], ["artwork_id", 4]]
---
  def create
    artworkshare = ArtworkShare.new(artworkshare_params)
    if artworkshare.save