W6D3/RoutesProject/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    if params.has_key?(:user_id)
      @artworks = Artwork.where(artist_id: params[:user_id])

    else
      @artworks = Artwork.all

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    artwork = Artwork.find_by(id: params[:id])

INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new_image"], ["img_url", "new_image.com"], ["artist_id", 1], ["created_at", "2023-08-03 15:32:32.030786"], ["updated_at", "2023-08-03 15:32:32.030786"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save