W7D2/practice-for-ch-rails-music-app-long-practice/MusicApp/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-08-08 18:29:42.741986"], ["id", 2]]